#+Title: Fixing Ementas 

* Collect files

(directory-files "~/Sites/emap.github.com/pos-graduacao/disciplina/")

#+name:graduacao
#+BEGIN_SRC elisp :results value :cache yes
  (mapcar (lambda (fn) `(,(replace-regexp-in-string "\.\./graduacao/disciplina/\\([a-zA-Z\-]+\\)\.md" "\\1" fn)))
          (file-expand-wildcards "../graduacao/disciplina/*.md"))
#+END_SRC

#+RESULTS[e3e74050478d08bbb27385ff368ae0bacc9cc8a6]: graduacao
| algebra-II                          |
| algebra-linear                      |
| algebra-teoria-numeros-criptografia |
| analise-II                          |
| analise-algoritmos                  |
| analise-numerica                    |
| analise                             |
| bancos-de-dados                     |
| calculo-I                           |
| calculo-II                          |
| calculo-III                         |
| calculo-IV                          |
| curvas-superficies                  |
| economia-temas-atuais               |
| estatistica-multivariada            |
| estatistica                         |
| estruturas-dados-algoritmos         |
| geometria-analitica-vetores         |
| geometria-em-aplicacoes             |
| inferencia-aprendizagem             |
| introducao-computacao-grafica       |
| introducao-computacao               |
| introducao-economia                 |
| introducao-teoria-medida            |
| linguagem-brasileira-sinais         |
| linguagens-programacao              |
| logica                              |
| matematica-discreta                 |
| modelagem-matematica-I              |
| modelagem-matematica-II             |
| modelagem-matematica-III            |
| modelagem-matematica-IV             |
| pesquisa-operacional-I              |
| pesquisa-operacional-II             |
| processos-estocasticos-simulacao    |
| redes-complexas                     |
| teoria-computacao                   |
| teoria-probabilidade                |
| topologia                           |
| visualizacao-da-informacao          |

#+name:mestrado
#+BEGIN_SRC elisp :results value :cache yes
  (mapcar (lambda (fn) `(,(replace-regexp-in-string "\.\./pos-graduacao/disciplina/\\([a-zA-Z\-]+\\)\.md" "\\1" fn)))
          (file-expand-wildcards "../pos-graduacao/disciplina/*.md"))
#+END_SRC

#+RESULTS[a560be5068c65a5fea462e2cf34f84f56f98ae8b]: mestrado
| algebra-linear-aplicacoes                        |
| analise-matematica-aplicacoes                    |
| aprendizagem-maquinas                            |
| construcao-avaliacao-ontologias                  |
| elaboracao-dissertacao                           |
| estruturas-dados-algoritmos                      |
| grafos-redes-sociais-conectividade               |
| introducao-linguistica                           |
| metodologia-cientifica                           |
| modelagem-equacoes-diferenciais                  |
| modelagem-mineracao-dados                        |
| probabilidade-inferencia                         |
| processamento-linguagem-natural-mineracao-textos |
| processamento-multimidia                         |
| representacao-conhecimento-linguagens-formais    |
| seminarios-pesquisa                              |
| simulacao-computacional                          |
| sistemas-recuperacao-informacoes                 |
| teoria-jogos-modelos-socioeconomicos             |
| topicos-avancados-inteligencia-artificial        |
| topicos-avancados-logica                         |
| topicos-avancados-matematica-aplicada            |
| visualizacao-informacao                          |

#+name:bib
#+BEGIN_SRC elisp :results value :cache yes
  (mapcar (lambda (fn) `(,(replace-regexp-in-string "\.bib" "" fn))) 
          (file-expand-wildcards "*-*.bib"))
#+END_SRC

#+RESULTS[28e42bd2fda292cec5876591fbbc6f27b5208a87]: bib
| grad-algebra-II                                        |
| grad-algebra-linear                                    |
| grad-algebra-teoria-numeros-criptografia               |
| grad-analise-II                                        |
| grad-analise-algoritmos                                |
| grad-analise-numerica                                  |
| grad-analise                                           |
| grad-bancos-de-dados                                   |
| grad-calculo-I                                         |
| grad-calculo-II                                        |
| grad-calculo-III                                       |
| grad-calculo-IV                                        |
| grad-curvas-superficies                                |
| grad-economia-temas-atuais                             |
| grad-estatistica-multivariada                          |
| grad-estatistica                                       |
| grad-estruturas-dados-algoritmos                       |
| grad-geometria-analitica-vetores                       |
| grad-inferencia-aprendizagem                           |
| grad-introducao-computacao                             |
| grad-introducao-economia                               |
| grad-introducao-teoria-medida                          |
| grad-linguagens-programacao                            |
| grad-logica                                            |
| grad-matematica-discreta                               |
| grad-modelagem-matematica-I                            |
| grad-modelagem-matematica-II                           |
| grad-modelagem-matematica-III                          |
| grad-modelagem-matematica-IV                           |
| grad-pesquisa-operacional-I                            |
| grad-pesquisa-operacional-II                           |
| grad-processos-estocasticos-simulacao                  |
| grad-teoria-computacao                                 |
| grad-teoria-probabilidade                              |
| grad-topologia                                         |
| mestr-algebra-linear-aplicacoes                        |
| mestr-analise-matematica-aplicacoes                    |
| mestr-aprendizagem-maquinas                            |
| mestr-construcao-avaliacao-ontologias                  |
| mestr-estruturas-dados-algoritmos                      |
| mestr-grafos-redes-sociais-conectividade               |
| mestr-introducao-linguistica                           |
| mestr-metodologia-cientifica                           |
| mestr-modelagem-equacoes-diferenciais                  |
| mestr-modelagem-mineracao-dados                        |
| mestr-probabilidade-inferencia                         |
| mestr-processamento-linguagem-natural-mineracao-textos |
| mestr-processamento-multimidia                         |
| mestr-representacao-conhecimento-linguagens-formais    |
| mestr-simulacao-computacional                          |
| mestr-sistemas-recuperacao-informacoes                 |
| mestr-teoria-jogos-modelos-socioeconomicos             |
| mestr-topicos-avancados-inteligencia-artificial        |
| mestr-topicos-avancados-logica                         |
| mestr-visualizacao-informacao                          |

* Testing Missing 

#+BEGIN_SRC elisp :var b=bib :var m=mestrado :var g=graduacao :cache yes :results value
(mapcar #'length (list b m g))
#+END_SRC

#+RESULTS[7fee1a2954f33d83a9ad348dd5022f4ce2add4a4]:
| 55 | 23 | 40 |

#+BEGIN_SRC R :var b=bib :var m=mestrado :var g=graduacao :results value
g$course <- "grad"
m$course <- "mestr"
tmp.1 <- data.frame(nm = b[grep("^grad-", b$V1),1])
tmp.1$V1 <- gsub("^grad-","",tmp.1$nm)
tmp.2 <- data.frame(nm = b[grep("^mestr-", b$V1),1])
tmp.2$V1 <- gsub("^mestr-","",tmp.2$nm)
tmp.3 <- merge(tmp.1, g, by = "V1", all=TRUE)
tmp.4 <- merge(tmp.2, m, by = "V1", all=TRUE)
tmp <- rbind(tmp.3,tmp.4)
tmp[is.na(tmp$nm),c(1,3)]
#+END_SRC

#+RESULTS:
| geometria-em-aplicacoes               | grad  |
| introducao-computacao-grafica         | grad  |
| linguagem-brasileira-sinais           | grad  |
| redes-complexas                       | grad  |
| visualizacao-da-informacao            | grad  |
| elaboracao-dissertacao                | mestr |
| seminarios-pesquisa                   | mestr |
| topicos-avancados-matematica-aplicada | mestr |

Verificando se todos os arquivos das ementas tem bib
correspondente. Trocar g por m e grad por mestr para testar mestrado
ou graduação. Faltam 8 ementas.

#+BEGIN_SRC lisp :var b=bib :var m=mestrado :var g=graduacao :results output
  (let ((res nil)) 
    (dolist (fn m (reverse res))
      (let* ((bn (car (cl-ppcre:split "\\." fn)))
             (nn (format nil "mestr-~a.bib" bn)))
        (print `(,(car (member nn b :test #'equal)) ,fn)))))
#+END_SRC

Agora vamos tentar identificar os arquivos sobrando em bib.

#+BEGIN_SRC lisp :var b=bib :var m=mestrado :var g=graduacao :results output
  (dolist (fn b)
    (let* ((bn (car (cl-ppcre:split "\\." fn)))
           (parts (cl-ppcre:split "-" bn))
           (prefix (car parts))
           (ementa (format nil "~{~a~^-~}.md" (cdr parts))))
      (if (equal prefix "grad") 
          (print `(,(car (member ementa g :test #'equal)) ,bn))
          (print `(,(car (member ementa m :test #'equal)) ,bn)))))
#+END_SRC

* Generating database

Must run first =(ql:quickload :cl-bibtex)=

#+BEGIN_SRC lisp :package "bibtex-runtime"
(defun proc-file (file)
  (let ((bn (pathname-name file))
	(db nil))
    (setf *bib-database* (make-hash-table))
    (with-open-file (in file)
      (read-bib-database in))
    (dolist (entry (mapcar #'cdr (alexandria:hash-table-alist *bib-database*)) db)
      (setf (bib-entry-ref "keywords" entry) bn)
      (push entry db))))

(defun proc-files (out-file &optional (pattern "*.bib"))
  (let ((db (apply #'append (mapcar #'proc-file (directory pattern)))))
    (with-open-file (out out-file :direction :output :if-exists :supersede)
      (dolist (entry db)
	(write-bib-entry entry out)))))

(proc-files "emap.bib")
#+END_SRC
